load-tests/k6/reports/20260727-224559/smoke-auth-stdout.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: C:\Users\omano\OneDrive - Puravankara Limited\Manoranjan\Antigravity Experiment\000 Project PM\SETU\load-tests\k6\scenarios\smoke-auth.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 45s max duration (incl. graceful stop):
              * default: 1 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 1/1 VUs, 583 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  01.0s/15s

running (02.0s), 1/1 VUs, 1165 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  02.0s/15s

running (03.0s), 1/1 VUs, 1757 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  03.0s/15s

running (04.0s), 1/1 VUs, 2334 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  04.0s/15s

running (05.0s), 1/1 VUs, 2916 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  05.0s/15s

running (06.0s), 1/1 VUs, 3488 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  06.0s/15s

running (07.0s), 1/1 VUs, 4067 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  07.0s/15s

running (08.0s), 1/1 VUs, 4637 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  08.0s/15s

running (09.0s), 1/1 VUs, 5196 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  09.0s/15s

running (10.0s), 1/1 VUs, 5786 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  10.0s/15s

running (11.0s), 1/1 VUs, 6380 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  11.0s/15s

running (12.0s), 1/1 VUs, 6957 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  12.0s/15s

running (13.0s), 1/1 VUs, 7542 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  13.0s/15s

running (14.0s), 1/1 VUs, 8072 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  14.0s/15s

     ✗ login status is 2xx
      ↳  0% — ✓ 0 / ✗ 8530

     checks.....................: 0.00%   ✓ 0          ✗ 8530
     data_received..............: 0 B     0 B/s
     data_sent..................: 0 B     0 B/s
     http_req_blocked...........: avg=0s     min=0s med=0s     max=0s      p(90)=0s     p(95)=0s    
     http_req_connecting........: avg=0s     min=0s med=0s     max=0s      p(90)=0s     p(95)=0s    
   ✓ http_req_duration..........: avg=0s     min=0s med=0s     max=0s      p(90)=0s     p(95)=0s    
   ✗ http_req_failed............: 100.00% ✓ 8530       ✗ 0   
     http_req_receiving.........: avg=0s     min=0s med=0s     max=0s      p(90)=0s     p(95)=0s    
     http_req_sending...........: avg=0s     min=0s med=0s     max=0s      p(90)=0s     p(95)=0s    
     http_req_tls_handshaking...: avg=0s     min=0s med=0s     max=0s      p(90)=0s     p(95)=0s    
     http_req_waiting...........: avg=0s     min=0s med=0s     max=0s      p(90)=0s     p(95)=0s    
     http_reqs..................: 8530    575.422821/s
     iteration_duration.........: avg=1.34ms min=0s med=1.04ms max=40.86ms p(90)=2.01ms p(95)=2.12ms
     iterations.................: 8530    575.422821/s
     vus........................: 1       min=1        max=1 
     vus_max....................: 1       min=1        max=1 


running (14.8s), 0/1 VUs, 8530 complete and 1 interrupted iterations
default ✗ [  99% ] 1 VUs  14.8s/15s